// Задача 19 - HARD необязательная

// Напишите программу, которая принимает на вход целое число любой разрядности и проверяет,
// является ли оно палиндромом. Через строку нельзя решать само собой.

Console.WriteLine("Введите число для дальнейшего анализа");
int x = Convert.ToInt32(Console.WriteLine());